Table of Contents
 Class ConcreteSLSCheckResultStiffness
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
SLS Check tiffness base
public abstract class ConcreteSLSCheckResultStiffness : ConcreteCheckResultBase
Inheritance
object
ConcreteCheckResultBase
ConcreteSLSCheckResultStiffness
Derived
ConcreteSLSCheckResultStiffnessEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CharacteristicsI
stiffnesses calculated on uncracked cross-section
public SectionCharacteristics CharacteristicsI { get; set; }
Property Value
SectionCharacteristics
 CharacteristicsII
stiffnesses calculated on cracked cross-section
public SectionCharacteristics CharacteristicsII { get; set; }
Property Value
SectionCharacteristics
 Fr
crack resistance internal forces
public ResultOfInternalForces Fr { get; set; }
Property Value
ResultOfInternalForces
 LinearStiffness
linear stiffnesses
public SectionStiffnesses LinearStiffness { get; set; }
Property Value
SectionStiffnesses
 Stiffness
result stiffnesses
public SectionStiffnesses Stiffness { get; set; }
Property Value
SectionStiffnesses
 StiffnessI
stiffnesses calculated on uncracked cross-section
public SectionStiffnesses StiffnessI { get; set; }
Property Value
SectionStiffnesses
 StiffnessII
stiffnesses calculated on fully-cracked cross-section
public SectionStiffnesses StiffnessII { get; set; }
Property Value
SectionStiffnesses
 Edit this page